import os
import numpy as np
from collections import defaultdict
from gensim import models
from gensim.models import Word2Vec
from pyltp import Segmentor
from pyltp import Postagger
from pyltp import Parser
from pyltp import NamedEntityRecognizer
from sklearn.feature_extraction.text import TfidfVectorizer
from pyltp import SentenceSplitter
from pyltp import SementicRoleLabeller

# Config
expect = 0.7
end_symbol = ['.','。','!','！','？','?']
start_symbol = [',','，',':','：','“','‘', '"', "'"]

# Model
LTP_DATA_DIR='./models'
# wikitext = '/Users/zhangjie/Documents/machinelearning/att/nplAssignments/assignment-4/zhwiki/cut/all.txt'
model = models.Word2Vec.load('./models/word2vec.model')

cws_model_path = os.path.join(LTP_DATA_DIR,'cws.model') #分词
pos_model_path = os.path.join(LTP_DATA_DIR,'pos.model') # 
ner_model_path = os.path.join(LTP_DATA_DIR,'ner.model')  # 命名实体识别模型路径，模型名称为`pos.model`
par_model_path = os.path.join(LTP_DATA_DIR,'parser.model')  # 依存句法分析模型路径，模型名称为`parser.model`
stop_words_path = './models/哈工大停用词表.txt'

#srl_model_path = os.path.join(LTP_DATA_DIR, 'pisrl.model')  # 语义角色标注模型目录路径

segmentor = Segmentor()
segmentor.load(cws_model_path)

# labeller = SementicRoleLabeller() # 初始化实例
# labeller.load(srl_model_path)  # 加载模型

postagger = Postagger() # 初始化实例
postagger.load(pos_model_path)  # 加载模型

parser = Parser() # 初始化实例
parser.load(par_model_path)  # 加载模型

recognizer = NamedEntityRecognizer() # 初始化实例
recognizer.load(ner_model_path)  # 加载模型

# Pre train data
say_similar = ['说', '答道', '问道', '反问', '感叹', '告诫', '告诉', '责怪', '责问', '指出', '说道', '声称', '说出', '曾言', '责备', '质问', '怒斥', '觉得', '直言', '慨叹', '赞道', '大骂', '辩称', '斥责', '认为', '却说', '指责', '宣称', '规劝', '坦言', '有言', '痛骂', '问', '问起', '叮嘱', '坚称', '驳斥', '否认', '唱道', '相信', '责骂', '表示', '怒骂', '提到', '询问', '回答', '写道', '重申', '断言', '确信', '反驳', '谈到', '地问', '曾谓', '劝诫', '指摘', '笑答', '察觉到', '坦承', '解释', '讥讽', '直说', '喊道', '透露', '告知', '自谓', '知道', '痛斥', '感慨', '时说', '戏言', '脱口而出', '自言', '怒道', '自云', '尝言', '透漏', '直斥', '陈述', '劝阻', '辱骂', '说明', '放过', '劝谏', '奉承', '诘问', '训斥', '澄清', '奏道', '答说', '想到', '认出', '断定', '谈及', '叹息', '诋毁', '所说', '明确指出', '引述', '转述', '评说', '劝', '埋怨', '求证', '进谏', '谴责', '中说', '指称', '批评', '追问', '哭道', '得知', '自述', '猜测', '取笑', '叹', '回应', '公开批评', '破口大骂', '诗云', '语云', '加害', '地说', '大喊', '大叫', '反唇相讥', '还称', '注云', '臣闻', '惊道', '亲眼看到', '骂', '并不认为', '明白', '回覆', '哀求', '为难', '坚信', '略云', '呵斥', '讥笑', '深信', '知晓', '嘲笑', '坦白', '痛批', '证实', '论断', '看来', '似乎', '明言', '自嘲', '谄媚', '中称', '大笑', '一再强调', '不解', '暗示', '叱责', '更称', '尝谓', '所言', '明说', '答', '信中称', '强调', '提及', '转告', '获知', '谎称', '声言', '指控', '推测', '要说', '指斥', '提问', '地称', '劝勉', '声明', '言明', '反指', '回忆起', '阐述', '佛告', '无礼', '抨击', '忘掉', '查问', '听到', '所述', '不禁', '答覆', '嘱咐', '劝告', '诉说', '怀疑', '质疑', '臆测', '道歉', '中载', '古者', '悔恨', '听信', '证明', '否定', '申明', '嘲讽', '辩解', '抹黑', '力劝', '致歉', '公曰', '常说', '表明', '特别强调', '援引', '称', '并不知道', '他称', '简直', '惊叹', '忆述', '盛赞', '表露出', '告戒', '表露', '普遍认为', '词曰', '描述', '忍不住', '大哭', '忧愁', '宣宗称', '顶撞', '求见', '请罪', '推论', '阐释', '披露', '交代', '交待', '揶揄', '记得', '发言', '发觉', '言道', '文曰', '认清', '文说', '想想', '发问', '自问', '承认', '名言', '无聊', '夸奖', '那句', '赞叹', '地写', '恳求', '忘记', '表态', '说辞', '夸赞', '指证', '详述', '举出', '奏言', '史载', '流泪', '批道', '古人云', '痛哭流涕', '皆曰', '嫌弃', '子贡曰', '陈说', '谏言', '也许', '或许', '严厉批评', '表述', '论点', '哭诉', '韦昭注', '劝导', '的确', '解读', '哀叹', '奏称', '帝说', '说法', '实在', '看上去', '地用', '劝戒', '训诫', '猜出', '回想', '记住', '形容', '之言', '说词', '高声', '供认', '供称', '说起', '理解', '俗话说', '谚云', '指明', '昔者', '想着', '哭泣', '怜惜', '闻言', '不答', '戏弄', '央求', '惊觉', '中伤', '求饶', '看不起', '原谅', '羞辱', '爱惜', '阐明', '信服', '隐瞒', '发表意见', '责难', '劝解', '倾听', '知悉', '喜道', '觉察到', '咒骂', '劝谕', '毁谤', '其实', '毕竟', '述说', '见解', '事实', '看似', '佩服', '狂妄', '惭愧', '自傲', '调侃', '巴结', '之语', '公说', '对元韶说', '看起来', '附和', '怀才不遇', '叹服', '抱怨', '地以', '地看', '在我看来', '原话', '易明', '恨', '表白', '听见', '说谎', '揭穿', '认定', '显然', '其言', '中写', '内称', '叫喊', '大声', '改口说', '一段话', '谈论', '写', '详细描述', '叫嚣', '有云', '名句', '引用', '赞其', '控诉', '答称', '斥骂', '回信', '转达', '声泪俱下', '闻者', '碰见', '纵容', '调戏', '获悉', '常称', '口头禅', '座右铭', '吩咐', '确认', '推断', '论述', '得悉', '供述', '批驳', '捏造', '称其', '诬蔑', '直称', '论据', '论证', '催促', '弄清楚', '倾诉', '对不起', '知会', '察觉', '真宗说', '宗说', '有载', '曾载', '序云', '诗吟', '看到', '看清', '看穿', '领悟到', '睡着', '放走', '撒谎', '耻笑', '供词', '确实', '第一句', '灰心', '可笑', '鄙视', '畏惧', '称许', '逢迎', '贪财', '赞许', '痛心', '其志', '惶恐', '感激', '发表声明', '求情', '劝说', '看看', '请教', '王说', '真是', '担心', '感觉', '自认', '出言', '答复', '地指', '勉励', '提防', '讲出', '读出', '表达', '教诲', '之论', '中所写', '喃喃自语', '高喊', '喝道', '俗语说', '地喊', '指着', '跪下', '烦', '得出结论', '矢口否认', '明知', '背诵', '谈起', '揭露', '论及', '提过', '记述', '记载', '一脸', '走开', '想不到', '一声', '蒋说', '悲叹', '寡人', '乃知', '一言', '问及', '撞见', '怕', '自叹', '听闻', '拜见', '喝醉', '再说', '责罚', '宽恕', '发怒', '评其', '揭示', '佐证', '赞扬', '指涉', '暗指', '污蔑', '重提', '称该', '言论', '偏颇', '嘲弄', '断章取义', '称之为', '称其为', '结论', '认错', '自辩', '奚落', '刁难', '听听', '怎么样', '禀告', '质询', '告发', '识破', '上议', '吟道', '中言', '载其', '忘却', '看见', '想起', '抓到', '救下', '误导', '鼓起勇气', '表示歉意', '狠批', '误以为', '剖白', '观点', '立论', '看法', '论调', '羡慕', '揣测', '误解', '赞美', '只不过', '总之', '即便', '没错', '哦', '太好了', '几句', '忧心', '疑惑', '无疑', '愚蠢', '可悲', '痛恨', '惧怕', '可怜', '笨拙', '苦恼', '不耐烦', '懊悔', '心痛', '诧异', '轻视', '挖苦', '称颂', '戏称', '诋', '阿谀奉承', '奸邪', '称赞', '激赏', '曾称', '惋惜', '流涕', '之文', '见者', '一笑', '痛哭', '动容', '不悦', '表示遗憾', '忆起', '地令', '复述', '抒发', '欺', '怜悯', '乞求', '不孝', '朕', '之者', '之体', '曼说', '提醒', '问过', '所称', '所指', '有点', '真的', '敢言', '遇事', '上称', '解答', '坦诚', '大赞', '说来', '奉劝', '念出', '视为', '看作', '其人', '所记', '时写', '喊', '喊叫', '回批', '提道', '作证', '控告', '说话', '讲解', '不信', '惊叫', '如是说', '写明', '述及', '听得', '评曰', '问说', '没事', '动怒', '说完', '盘问', '请问', '大怒', '气得', '挽联', '写信', '传话', '毛说', '无言以对', '默然', '叫醒', '偷看', '曰', '哽咽', '记恨', '闻知', '假称', '上奏', '密奏', '召见', '说情', '辞谢', '怠慢', '笑称', '参奏', '闻其名', '确证', '提倡', '明示', '爆料', '体认到', '指', '特指', '申辩', '了解', '敦促', '促请', '非议', '会称', '而称', '只称', '多称', '假设', '证伪', '谬论', '打听', '打探', '看一看', '干什么', '看着', '搞清楚', '禀报', '致电', '搞定', '作答', '自我介绍', '推辞', '传唤', '指认', '供出', '进言', '杨荣称', '曾云', '谓', '见到', '晓得', '认得', '预料到', '洞悉', '预见到', '深知', '罢休', '辜负', '捉住', '害死', '拦住', '制伏', '入睡', '指望', '警惕', '诬告', '所作所为', '冤枉', '指陈', '袒护', '力挺', '承担责任', '提出异议', '起诉', '谣传', '传闻', '传言', '查证', '确定', '辨认出', '如果说', '毫无疑问', '称为', '用法', '回忆', '敬畏', '内心深处', '疑问', '一句', '评语', '大意', '事实上', '尽管', '啊', '沮丧', '感到遗憾', '厌烦', '忧虑', '不知所措', '郁闷', '困惑', '就算', '幼稚', '害怕', '想念', '仰慕', '害羞', '难受', '难过', '不自在', '古怪', '担忧', '疑虑', '怨恨', '那种', '乍看之下', '仿佛', '显得', '样子', '好像', '好看', '生气', '伤心', '欣喜', '委屈', '秉性', '刚愎自用', '恼怒', '欺负', '诬陷', '敷衍', '诬', '结党营私', '轻佻', '刚正', '不负责任', '用事', '之臣', '虚心', '言及', '赞赏', '中所称', '躬', '忧', '钦佩', '故作', '回函', '表示同意', '申述', '公函', '改口', '谦卑', '地向', '易懂', '视之为', '流露', '记下', '地使', '地站', '显出', '流露出', '抒写', '苦谏', '谏阻', '顺服', '安慰', '苦苦哀求', '恳请', '言行', '教导', '做爱', '发洩', '认作', '误认为', '看做', '视作', '指为', '看成', '岂', '辄', '之谋', '其心', '误国', '之迹', '今人', '评道', '听说', '推说', '讲法', '感到', '讨厌', '不好意思', '在意', '无耻', '对答', '时称', '尼说', '时指', '以为', '主张', '言', '司马迁', '苦衷', '不以为然', '司马光', '听', '看', '读', '骂人', '恭维', '高叫', '抱住', '哭喊', '斯说', '特说', '基说', '克说', '奇说', '斯称', '森说', '首句', '面露', '起身', '唿救', '梅尔说', '心怀', '悲哀', '叹气', '问于', '诸君', '喝止', '复信', '题词', '写给', '略谓', '听罢', '哈哈大笑', '相告', '叫骂', '拍桌', '迁怒于', '不杀', '唯恐', '进见', '召来', '奏明', '数落', '眼里', '平生', '作诗', '赋诗', '叮咛', '伺候', '上言', '以事', '参劾', '传旨', '致书', '不纳', '保持沉默', '拒绝接受', '视而不见', '凸显', '突显', '着眼于', '贬低', '体现', '尊重', '明确提出', '认同', '报导', '投书', '刊出', '转载', '刊发', '登载', '凸显出', '代指', '影射', '曲解', '纠正', '简述', '反映', '另据', '称因', '打压', '挞伐', '人身攻击', '编造', '其称', '称称', '词称', '称此', '认', '假定', '猜想', '谬误', '预言', '征询', '察看', '求助', '逼问', '问话', '试试', '问问', '谈谈', '走近', '看清楚', '传授', '讨教', '听讲', '电告', '面见', '写信给', '密报', '说好', '说些', '恭喜', '致谢', '答对', '抢答', '答案', '讨论', '赴约', '称病', '当官', '举报', '检举', '带走', '黯说', '联曰', '坚说', '古有', '古之', '有谓', '郑玄注', '又谓', '注称', '中有载', '简说', '吼道', '农说', '面说', '往者', '之贤', '之节', '尝以', '诗称', '赞之', '说得好', '醒悟', '要死', '自勉', '诗中称', '占名', '探知', '探听', '传开', '清楚', '从未见过', '留意到', '听过', '料到', '杀掉', '得逞', '求助于', '干掉', '招供', '劝服', '一死', '杀死', '盯上', '抓走', '逮到', '拿走', '甩掉', '取走', '查明', '响起', '惊醒', '闻到', '聆听', '吓唬', '提示', '留意', '劝喻', '诈称', '要钱', '谋害', '道谢', '出庭作证', '痛打', '反批', '大谈', '扬言', '发誓', '公然', '执意', '想过', '爱过', '来接', '提告', '认可', '认罪', '赞同', '揭发', '定罪', '查出', '始终认为', '不在乎', '纪载', '所载', '专指', '称作', '仅指', '所谓', '所知', '约定俗成', '仅称', '涵义', '自相矛盾', '自序', '口述', '追忆', '评点', '论说', '学说', '假说', '想像中', '思索', '领会', '深思', '杜撰', '真意', '做梦', '心中', '阴谋论', '结语', '谣言', '译法', '来说', '来讲', '而言', '推断出', '推知', '判断', '推想', '推定', '界定', '探究', '评断', '这段话', '开示', '要是', '难道', '是不是', '这样的话', '讲得', '呀', '大感', '不已', '内疚', '万分', '不安', '反倒', '荒谬', '当然', '更何况', '憎恨', '瞧不起', '粗鲁', '刻薄', '看重', '无趣', '乏味', '沉闷', '好笑', '好玩', '放肆', '丢脸', '家伙', '不敢相信', '蠢', '何况', '恐怕', '猜疑', '眼神', '心情', '内心', '愉悦', '精神状态', '神经质', '触感', '笑容', '长得', '外表', '苍白', '似的', '看不出来', '暗淡', '茫然', '脸色', '好事', '想必', '竟然', '可恶', '虽然', '可能', '因为', '实际上', '即使', '冷漠', '全然', '感触', '愧疚', '气馁', '吃惊', '后悔', '自知', '固执', '绝非', '在乎', '讶异', '恼火', '真心', '捉弄', '作弄', '吹捧', '构陷', '徇私', '讽刺', '挑逗', '耿直', '刚直', '谦虚', '言辞', '直谏', '谦恭', '耿介', '处事', '老成', '忠厚', '为人正直', '恭谨', '坦率', '可耻', '不逊', '奸佞', '阿谀', '骄纵', '交结', '骄横', '卢杞', '借故', '当面', '发声明', '诗有', '谈话', '凄凉', '世事', '唏嘘', '闻', '怨', '之状', '涕泣', '故曰', '号哭', '哭', '不觉', '哀恸', '敬佩', '折服', '惊异', '肃然起敬', '叹为观止', '惊艳', '惊愕', '落泪', '神情', '不学无术', '惊骇', '讲话', '处理事件', '回电', '让步', '批示', '复电', '照会', '通牒', '最后通牒', '新闻稿', '信函', '更正', '辩护', '命题', '誉为', '赞不绝口', '直率', '体谅', '率直', '地有', '显现出', '暗示着', '易记', '废话', '事理', '无非', '哼', '地读', '写得', '写出', '写下', '地于', '地为', '地要', '地替', '地唱出', '透出', '地去', '展现出', '地被', '地变', '地算出', '吐字', '显露出', '显露', '展露', '怀着', '勾起', '谏止', '训勉', '持守', '事奉', '怂恿', '挽留', '开导', '忠告', '打骂', '连累', '毒打', '教子', '忏悔', '轻慢', '寇准', '怀恨', '迟疑', '不忿', '羞愧', '不屑', '愤恨', '气愤', '忿', '惧', '覆述', '释怀', '展现', '附上', '拼出', '朗读', '填上', '欺骗', '无知', '公认', '喻为', '当作', '当成', '当做', '描绘成', '塑造成', '称做', '算作', '归因于', '归结为', '引申为', '冒犯', '不免', '不实', '提出抗议', '承认错误', '失言', '毫无根据', '实情', '证言', '莫能', '如是', '不闻', '冤', '之事', '其功', '心性', '知其', '之词', '其义', '之辞', '不言', '之教', '知者', '持论', '不置可否', '班固', '郑玄', '欧阳修', '宋人', '刘知几', '沈约', '贾谊', '蔡邕', '刘歆', '韩愈', '颜真卿', '中读', '中查', '梦中见', '俏妞报', '上读', '我读', '当读', '后写', '中问', '他读', '首篇', '讲', '据称', '所想', '心里', '兴致', '本心', '中所言', '喊一声', '正说', '李说', '操', '懂', '诵读', '唱', '讲故事', '谈', '唸', '说教', '聊', '采访', '唿喊', '大吼', '曼在', '坦说', '曼是', '登说', '利将', '基和', '诺是', '金说', '迪在', '戈德', '瓦泽', '菲厄泽', '森是', '偈言', '禁不住', '生怕', '挥手', '应声', '黄国兆说', '有道是', '侯湘芹', '宣传语', '真嗣说', '鑑外纪', '序说', '陆译', '客滇述', '吴范说', '留恋', '哀伤', '宽慰', '安静下来', '何不', '信中', '信上', '一封', '拂袖而去', '祢衡', '问到', '聊到', '疏言', '上联', '公一人', '疏道', '喊冤', '怪罪', '问罪', '初闻', '今天天气', '孟子曰', '非常高兴', '知到', '大惊', '闻听', '果然', '闻讯', '问其', '谢罪', '与其说', '正人君子', '赠诗', '至孝', '留心', '所奏', '奏报', '边事', '传谕', '上疏', '告谕', '奏闻', '帝以', '表奏', '疏劾', '诘责', '宽宥', '诏以', '显示', '意味着', '结果表明', '注重', '着重', '宣扬', '务实', '探讨', '反思', '包容', '讲求', '秉持', '个人行为', '明确规定', '明文规定', '载明', '注明', '列明', '明定', '传出', '报道', '撰文', '路透社', '法新社', '发表文章', '摒弃', '指代', '驳倒', '概述', '剖析', '宣示', '承诺', '提出', '删去', '收录', '称有', '批判', '评论', '触犯', '草拟', '引证', '来称', '作称', '唿大睡', '吸中', '这一称', '吸时', '当称', '以称', '公理化', '先验', '蕴涵', '拒绝', '听取', '打电话', '追查', '走走', '快点', '一下', '坐下', '摸', '赶快', '做些', '求教', '请益', '拜师学艺', '求取', '探问', '拜师', '毛遂自荐', '拜访', '传授给', '告之', '约见', '转报', '发电报', '转呈', '晋见', '想一想', '干嘛', '想不出', '做个', '来电', '杀了人', '罢手', '念及', '要告', '顾念', '祸及', '信以为真', '讯问', '自首', '举发', '审问', '传召', '报案', '报警', '查访', '探视', '通知', '林希说', '我朝', '怒叱', '公者', '承畴', '先君', '产说', '齐侯', '约法三章', '之亡', '载述', '序卦传', '更言', '杀人偿命', '中亦称', '陵迟', '何得', '死生', '乃曰', '臣愿', '不有', '匹夫', '其情', '之忠', '竖子', '不乐', '或曰', '天位', '雅性', '徐阶说', '似忠', '吉说', '谢安说', '无憾', '活下去', '不怕死', '忘不了', '不要紧', '道破', '心满意足', '提心吊胆', '临到', '常言道', '详述如下', '姚建宗', '劝道', '我于', '常言', '落笔', '之兴', '谀', '宁逢', '神武帝', '即立', '找到', '认不出', '无人知晓', '看不到', '不得而知', '洩露', '发现自己', '查觉到', '想出', '碰到', '停下来', '回心转意', '照办', '赶走', '答应', '除掉', '捉到', '惹怒', '摆平', '认出来', '吓坏', '刺伤', '偷走', '抓住', '接到', '送达', '走漏', '查清', '截获', '收到', '传来', '亲眼目睹', '亲眼见到', '刺死', '丢下', '送走', '搭救', '逮住', '上床睡觉', '预见', '容忍', '预知', '警告', '警示', '唿吁', '示意', '问候', '注意安全', '要求', '讹称', '假装', '伪称', '冒充', '诬赖', '一怒之下', '买通', '一口咬定', '嫁祸', '佯称', '对质', '痛殴', '恶意中伤', '指若', '暗讽', '林淑芬', '叶宜津', '朱高正', '诬指', '矢言', '谈过', '见过', '帮过', '讲过', '料想到', '结过婚', '接电话', '提起过', '夸口', '找过', '说过', '料想', '呛', '发脾气', '接纳', '同意', '敌视', '法律承认', '背书', '支持', '刑求', '诽谤', '涉嫌', '包庇', '被控', '刑讯逼供', '叛国', '控罪', '滥用权力', '据说', '据信', '据传', '据悉', '据报', '据闻', '疑似', '凶手', '袭击者', '发现', '核实', '寻获', '记录在案', '从来不', '节录', '摘录', '可知', '惯称', '多指', '通称', '习称', '尊称', '概称', '贬称', '所见', '代称', '泛称', '含意', '原意', '本意', '单指', '字义', '狭义', '含义', '同义', '意思', '专有名词', '望文生义', '就是指', '语源', '并不相同', '所用', '亲身经历', '回忆录', '个人经历', '自传', '墓志铭', '前半生', '日记', '生平', '序文', '笔录', '反证', '想像', '想象', '罢了', '行为表现', '意料', '如己', '推敲', '所思', '所行', '归宿', '乐在其中', '慢工', '代笔', '亲笔信', '误读', '流言', '格言', '谚语', '诗句', '不朽', '中心思想', '警句', '成语', '典故', '叫法', '消息来源', '众说纷纭', '做法', '称谓', '来历', '眼中', '来看', '这方面', '确知', '看出', '弄清', '判明', '得出', '考证', '推估', '估计', '研判', '推算', '估算', '考据', '概括', '诠释', '定义', '分法', '正读', '法门', '顿悟', '契经', '错误观念', '所传', '义理', '读法', '文句', '俗谚', '俗语', '屌', '都行', '想见', '啥', '他妈的', '深感', '颇感', '倍感', '感到恐惧', '心存', '深表', '甚感', '极度', '令人', '焦躁', '恐惧', '心生', '略感', '漠不关心', '肤浅', '不切实际', '微不足道', '浪费时间', '固然', '喜欢', '厌恶', '疼爱', '胆小', '忌妒', '憎恶', '好色', '调皮捣蛋', '懒散', '嫉妒', '吓人', '多愁善感', '平淡', '吵闹', '枯燥', '迟钝', '可不是', '根本就是', '太棒了', '该死', '一辈子', '瞧', '真是太', '很棒', '怎', '老实', '着实', '唉', '吃苦', '深怕', '顾虑', '反感', '抗拒', '放任', '感受', '感', '错觉', '幻觉', '罪恶感', '冲动', '表情', '感官', '体会', '感知', '意识', '情感', '声音', '焦虑', '安全感', '恐惧感', '兴奋', '感观', '心境', '思绪', '有点像', '蓬松', '面容', '阴沉', '瘦弱', '脸庞', '丑陋', '结实', '心底', '暗暗', '心头', '整天', '偏偏', '忧伤', '莫名', '眼前', '太过', '没什么', '很', '略显', '非常', '脾气', '有种', '带点', '十分', '轻浮', '过于', '颇为', '彻头彻尾', '哪怕', '多么', '出了名', '何等', '居然', '这点', '却', '好奇心', '胃口', '好奇', '怒气', '怨气', '不快', '乐趣', '恨意', '变得', '粗糙', '外形', '圆滑', '一样', '黯淡', '轮廓', '看不见', '抱歉', '纳闷', '高兴', '倒楣', '难听', '好听', '疼', '不服气', '不来', '失礼', '人品', '私心', '自负', '做事', '惟独', '浅薄', '愧对', '有心', '尚且', '领悟', '认识', '懂得', '恍然大悟', '介意', '挑剔', '吃力', '稀奇', '吃亏', '相像', '离谱', '客气', '熟稔', '引人注意', '懊恼', '着急', '气恼', '厉害', '费力', '差劲', '划算', '我', '的话', '你', '什么', '究竟', '甚么', '到底', '怎么', '为什么', '妳', '唾弃', '非但', '深究', '讲明', '得罪', '触怒', '声讨', '吁请', '惩办', '卖国', '罗织', '斥', '弹劾', '忤逆', '责', '戏谑', '反讽', '开玩笑', '粗俗', '幽默', '不要脸', '闭嘴', '神算', '清廉', '廉洁', '刚正不阿', '正直', '刚毅', '气节', '干练', '刚强', '宽厚', '勤政', '卑鄙', '卑劣', '恶毒', '凶残', '残忍', '奸诈', '嚣张', '狠毒', '伪善', '龌龊', '厚颜无耻', '令人发指', '丧心病狂', '蛮横', '荒唐', '冷血', '明目张胆', '残暴', '待人', '居官', '持重', '平素', '事事', '节操', '恃', '才识', '不畏', '自恃', '不喜', '清高', '骄奢', '弄权', '专横', '乱政', '擅权', '对答如流', '交游', '宴游', '议论', '文辞', '才学', '讽谏', '从容', '吟诗', '喜怒', '辩', '严词', '百般', '严辞', '当众', '谩骂', '失态', '反遭', '遭人', '恳切', '刊布', '后称', '时名', '有称', '誉之为', '素称', '并称', '时改', '原称', '初名', '治隆', '时属', '据载', '文必', '奚关', '基称', '德说', '迪说', '什称', '写到', '兰说', '赞', '安说', '微博称', '上以', '上多称', '上同', '文称', '微博说', '上作', '招开', '昨', '郑永健', '钟庭耀', '昨在', '指已', '马斐森', '潘恆旭', '林奋强', '郑耀宗', '张晓明', '郑宇硕', '陈维安', '杨润雄', '林郑', '罗范椒芬', '林卓廷', '曾俊华', '艾勤贤', '陈浩天', '曾钰成', '唐英年', '君尧', '顾立雄', '杜耀明', '究心', '近人', '谈迁', '名篇', '其书', '纰缪', '太史公', '畅谈', '专访', '经典台词', '我用', '随口', '那句话', '打油诗', '那首', '连篇', '惆怅', '感悟', '伤感', '泣', '生民', '长叹', '天下事', '之志', '自若', '无愧', '不忍', '敬仰', '称誉', '感佩', '称道', '着迷', '惊讶', '刮目相看', '陶醉', '雀跃', '垂涎', '黛玉', '不由得', '大吃一惊', '泪流满面', '郁郁', '不得志', '潦倒', '闷闷不乐', '穷困潦倒', '落魄', '失意', '郁郁寡欢', '书生', '沉默不语', '纵情声色', '鄙夷', '悲愤', '三餐不继', '之痛', '缠绵', '多病', '仕宦', '为之动容', '心服', '扼腕', '嗟叹', '侧目', '叹惜', '深恨', '畏服', '震恐', '敬服', '痛惜', '愤怨', '怨愤', '放声', '发抖', '哀号', '拍手', '点头', '听后', '表达意见', '面谈', '致词', '致辞', '对话', '发帖', '谅解', '来函', '请示', '密电', '上报', '留言', '贴文', '寄出', '争辩', '抗辩', '解法', '题目', '求解', '解决', '谜题', '解析', '解决问题', '找出', '疑难', '方程组', '导出', '解', '近似值', '形式系统', '解题', '措辞', '忆及', '亲述', '有感', '受访', '赞誉', '高度评价', '高度赞扬', '推崇', '赞颂', '评价', '秉持着', '诚恳', '诚实', '真诚', '诚挚', '亲切', '冷静', '体贴', '发自内心', '严肃', '认真', '小心谨慎', '谦逊', '耐心', '自信', '谨慎', '机智', '真挚', '衷心', '低调', '引起争议', '偏袒', '激赞', '叫好', '看不过眼', '报以', '深深感动', '伴有', '体如', '指对', '只会用', '用词', '下结论', '不提', '夹杂着', '如称', '能称', '及称', '打招', '便称', '而论', '观之', '解释性', '粗浅', '总而言之', '谈不上', '诚然', '不着边际', '精微', '论理', '其说', '不谈', '乞题', '打量', '地唱', '地刻', '地笑', '地过', '暗含', '内写', '嚷', '啜泣', '预示', '地待', '地是', '能以', '地', '仅以', '尚称', '地获', '用', '试图用', '用手', '摆弄', '便用', '挥动', '先用', '再用', '地取', '掂量', '只谈', '分清', '通过考察', '有悖于', '定义出', '就事论事', '推求', '这就是说', '去数', '化约', '解方程', '表达清晰', '勾划', '解得', '求变', '站得住脚', '不管怎样', '人生在世', '糟透了', '归根到底', '波卓', '你们', '做得好', '广告语', '原文', '附言', '具体做法', '易用', '艰涩', '难懂', '浅白', '易读', '简洁', '条理清晰', '晦涩', '简练', '辞藻', '生硬', '用典', '平易', '易写', '明快', '通俗易懂', '深入浅出', '直白', '隽永', '工整', '浅显易懂', '简明', '洗练', '诙谐', '卖弄', '给人以', '怀有', '满怀', '描绘出', '妄动', '不拜', '诚心', '殷勤', '悔改', '咒诅', '嘱托', '临终时', '辞别', '立誓', '设宴款待', '登门拜访', '奉养', '假意', '劝诱', '说服', '请求', '建议', '逼迫', '陈言', '孝经', '纳谏', '上章', '忠言', '历数', '别传', '酒肉', '训示', '不敬', '污辱', '严惩', '违抗', '辞让', '贾充', '明帝', '灵帝', '王导', '谗言', '张温', '公孙弘', '奉迎', '劝止', '劝降', '阻拦', '叩头', '怒不可遏', '含泪', '身体力行', '以身作则', '感念', '期勉', '勤勉', '期许', '报国', '敬爱', '陶冶', '相待', '爱护', '无私奉献', '颂扬', '抚慰', '嗜酒', '讨好', '恫吓', '防备', '严防', '窥伺', '松懈', '吓退', '防范', '制止', '保持警惕', '付出代价', '图谋不轨', '密告', '大不敬', '声张', '小看', '容不下', '教给', '讲讲', '吝惜', '招聚', '惊动', '见见', '严刑拷打', '冷嘲热讽', '嫉恨', '出言不逊', '为非作歹', '不舍', '愕然', '大惑不解', '倾慕', '难堪', '哀痛', '忌惮', '忿恨', '枉', '愁', '骨肉', '隐忍', '奈何', '穷', '怒', '痴', '忘恩负义', '悲', '心肠', '求婚', '告白', '示爱', '道别', '提亲', '一见钟情', '爱意', '求爱', '爱慕', '亲吻', '示好', '勾引', '拥抱', '下战书', '就让', '猜到', '聊起', '听得懂', '吵醒', '惨叫', '闪过', '瞥见', '打开门', '尖叫声', '猜中', '问出', '接住', '解出', '集齐', '掩饰', '改过', '诉说着', '叙说', '怀念', '夸耀', '讲述', '思念', '填入', '点选', '键入', '读取', '标出', '标明', '读入', '标示出', '按下', '插入', '省去', '填写', '唱名', '问句', '拼成', '点击', '按住', '离别', '自言自语', '哼唱', '往事', '单恋', '胡说八道', '谎话', '谎言', '打人', '别人', '无中生有', '犯错', '胡说', '说实话', '懦夫', '记熟', '吟诵', '来读', '朗诵', '讲完', '每句', '看不懂', '吟唱', '配演', '填进', '台词', '牢记', '读懂', '做到', '改掉', '遗忘', '忘', '丢掉', '误入歧途', '弄错', '继续下去', '拆穿', '揭破', '揪出', '掳走', '蒙骗', '栽赃', '绑架', '暗算', '击垮', '玷污', '陷害', '救回', '激怒', '枪杀', '杀人灭口', '看好', '看淡', '熟知', '列为', '作为', '视同', '视其为', '赋予', '定为', '误会', '判定', '定性', '评定', '裁定', '选定', '鉴定', '批准逮捕', '鑑定', '误传', '比喻', '蔑称', '说成', '想成', '比作', '想像成', '称得上', '视做', '争议', '置疑', '漠视', '异议', '无以', '不知', '误信', '无不', '只求', '想得到', '忠于', '爱好和平', '坚定', '珍视', '爱着', '屈服于', '寄希望于', '恪守', '显而易见', '根本', '必然', '事实证明', '明显', '如果', '疑点', '存疑', '夸大', '炒作', '反对', '立场', '鼓吹', '原则', '倡导', '观念', '思想', '政治理念', '民族自决', '坚持', '空谈', '力主', '政策', '国体', '在政治上', '唯物主义', '国策', '和平主义', '成见', '政治路线', '个人主义', '传达', '唤起', '宣泄', '彰显', '表达出来', '发泄', '激发', '辨别', '辟谣', '发表谈话', '态度强硬', '动武', '采取行动', '退选', '组党', '暗喻', '隐喻', '下跪', '歉意', '鞠躬', '登报', '表示感谢', '赔礼道歉', '深表遗憾', '公开信', '书面声明', '通告', '宣言', '文告', '联合声明', '起诉书', '公告', '新闻公报', '电文', '请愿书', '备忘录', '恶行', '过错', '无稽之谈', '罪大恶极', '不忠', '历史事实', '无稽', '罪责', '之举', '未闻', '辨', '能事', '法者', '矣', '莫不', '未备', '先帝', '崔浩', '皇上', '慨然', '秦桧', '杨国忠', '张华', '方孝孺', '众心', '其君', '耿南仲', '张昭', '善行', '孝道', '圣贤', '智者', '修养', '学问', '慈爱', '受苦', '心志', '德行', '上师', '天父', '慈悲', '教化', '苦修', '开悟', '诸人', '之徒', '人臣', '不传', '何人', '知见', '善者', '不生不灭', '恶业', '之理', '一切众生', '其身', '立身', '虚妄', '无有', '之道', '之法', '觉知', '仁者', '恶者', '佛性', '一念', '之性', '明心见性', '犯行', '证词', '言词', '内情', '案情', '理据', '悔意', '证供', '事实真相', '自白', '考订', '所引', '中所载', '今本', '本朝', '不载', '所撰', '记有', '清人', '竹书纪年', '遗文', '佚文', '旧史', '旧志', '野史', '诸书', '记事', '诸家', '宋史', '颜师古', '本纪', '未载', '征引', '古今之', '之旨', '之传', '之宗', '之学', '之本', '后学', '名教', '此理', '六经', '章句', '比附', '刘向', '陈寿', '董仲舒', '范晔', '李淳风', '孟子', '裴松之', '韩非', '杜预', '史官', '扬雄', '刘勰', '晋人', '白居易', '杜佑', '曹植', '陶渊明', '魏收', '万般', '骄傲自大', '恻隐之心', '心事', 'Nemorino', '孝心', '少君', '开解', '之恨', '情郎', '天意', '莫敢', '以闻', '焉', '庶几', '诸臣', '大喜', '赦', '不以为意', '不妥', '不为所动', '犹豫不决', '不屑一顾', '毫不在意', '深信不疑', '愤愤不平', '轻率', '王安石', '褚遂良', '范仲淹', '苏轼', '章学诚', '王世贞', '韩琦', '曾巩', '富弼', '王夫之', '顾炎武', '蔡京', '朱熹', '陆贽', '张居正', '魏征', '柳宗元', '牛僧孺', '当问', '能查', '上查', '当轮', '作写', '可查', '预感', '社调', '深切体会', '送炭', 'ch1', '第一章', '第四章', '那本', '第九章', '第一卷', '第三卷', '笔记', '第一册', '第一篇', '书简', '短文', '所写', '节选', '书信集', '巨着', '第二册', '手记', '忏悔录', '序言', '编类', '卷八', '卷下', '杂录', '丛话', '并序', '说文解字', '诗说', '释名', '鑑论', '丛考', '注引', '志三', '皇明', '集解', '中记', '因读', '时读', '读到', '所读', '枕边', '脱稿', '绝笔', '时问', '读完', '钱钟书', '下课后', '读通', '全文如下', '朱批', '电令', '通令', '布告', '上谕', '训令', '电示', '电称', '呈文', '郑重声明', '三大纪律', '吾友', '黑笔', '毛方记', '报道']

def execute(content):
    n_list = []
    say_list = []
    ns_list = []
    says_list = []
    what_list = []

    stop_words = []

    def get_stop_words(path):
        with open(path,'r') as f:
            for line in f.readlines():
                stop_words.append(line[:-1])
            return stop_words
        
    # print('-----stopwordssss',len(get_stop_words(stop_words_path)))


    def tf_idf_word(n,corpus):
        word_tfidf = defaultdict(int)
        vector = TfidfVectorizer() 
        tfidf = vector.fit_transform(corpus) 
        
        wordlist = vector.get_feature_names()
        weightlist = tfidf.toarray()
        for j in range(len(wordlist)):
            word_tfidf[wordlist[j]]=weightlist[n][j]

        return word_tfidf 

    def word2vec(word):
        try:
            return model[word]
        except KeyError:
            # print("not in vocabulary")
            return np.zeros(200)

    def sentence_vec(n,corpus):
        words_pre = list(segmentor.segment(corpus[n]))
        words = [word_i for word_i in words_pre if word_i not in stop_words]
        # print('words99999',words[0])
        tf_input1 = ' '.join(segmentor.segment(corpus[n]))
        tf_input2 = []
        for co in corpus:
            tf_input2.append(' '.join(segmentor.segment(co)))
                
        tf_idf_result = tf_idf_word(n,tf_input2)
        s= np.sum([word2vec(word)* tf_idf_result[word] for word in words if word not in end_symbol],axis=0)/len(words)

        return s

    def cosine_dis(vector1, vector2):
        return np.dot(vector1,vector2)/(np.linalg.norm(vector1)*(np.linalg.norm(vector2)))

    string_rows = content.split('\n')
    results = []

    for string_per_row in string_rows:
        # print(string_per_row)
        
        words = segmentor.segment(string_per_row) #分词
        # print('\t'.join(words))
        
        postags = postagger.postag(words)  # 词性标注
        # print ('\t'.join(postags))
        postaglist = [pos for pos in postags]
        # print(postaglist)
        
        netags = recognizer.recognize(words, postags)  # 命名实体识别
        # print('\t'.join(netags))

        arcs = parser.parse(words, postags)  # 句法分析
        # print ("\t".join("%d:%s" % (arc.head, arc.relation) for arc in arcs))
        
        replay_id = [arc.head for arc in arcs]
        relation = [arc.relation for arc in arcs]
        #print(replay_id)
        #print(relation)
        
        start_id = 0
        for i in range(start_id,len(words)):
            if (words[i] in say_similar and i>=start_id):
                # print(i,words[i])
                result = {}
                for j in range(start_id,i):
                    if (relation[j]=='SBV' and (postaglist[j].startswith('n') or postaglist[j].startswith('r') )):
                        # print('j is ....',j)
                        result['subject']= words[j]
                        result['verb'] = words[i]
                        tem_sentence = ''
                        
                        words_temp = ''
                        words_temp1 = ''
                        for k in range(i+1,len(words)):
                            #print('k is ' ,k)
                            #print('word is ', words[k])
                            if(k == (i+1) and words[k] in start_symbol ):
                                #print('k con is ' ,k)
                                continue
                            words_temp +=words[k]

                        wordsen_temp = list(SentenceSplitter.split(words_temp)) #分句

                        wordsen_temp = [sen for sen in wordsen_temp if sen != "。"]
                                            
                        
                        if len(wordsen_temp)==0:
                            result['sentence'] = ''
                        elif len(wordsen_temp)==1:
                            start_id = i + len(segmentor.segment(wordsen_temp[0]))
                            result['sentence'] = wordsen_temp[0]
                        elif len(wordsen_temp)>1:
                            start_id = i + len(segmentor.segment(wordsen_temp[0]))
                            # print(i)
                            # print(len(segmentor.segment(wordsen_temp[0])))
                            # print('startid0000',start_id)
                            # print(wordsen_temp)
                            vec1 = sentence_vec(0,wordsen_temp)
                            wordsen_temps=wordsen_temp[0] 
                            for r in range(1,len(wordsen_temp)):
                                # print('rr----',r)
                                vecr = sentence_vec(r,wordsen_temp)
                                # print(vecr)
                                # print('vec1-----', vec1)
                                # print('cosine_d is--------',cosine_dis(vec1, vecr))
                                if cosine_dis(vec1, vecr) > expect:
                                    wordsen_temps += wordsen_temp[r]
                                    start_id+= len(segmentor.segment(wordsen_temp[r]))
                                    # print('startid2222',start_id)
                                else:  
                                    break
                            result['sentence'] = wordsen_temps          
                results.append(result)
        
    print(results)
    return results
